create_clock -period 4.000 -name clk -waveform {0.000 2.000} -add [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports rst]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports rst]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {request[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {request[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports wen_OM_data]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports wen_OM_data]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports ren_OM_data]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports ren_OM_data]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {data_w_OM[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {data_w_OM[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {data_r_OM[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {data_r_OM[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {addr_w_OM_data[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {addr_w_OM_data[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {addr_r_OM_data[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {addr_r_OM_data[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports ren_OM_inst]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports ren_OM_inst]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {inst_r_OM[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {inst_r_OM[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {addr_r_OM_inst[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {addr_r_OM_inst[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports wen_SCmem]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports wen_SCmem]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {wen_IB[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {wen_IB[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {wen_KSP[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {wen_KSP[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports wen_BSP]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports wen_BSP]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {data_w_SC[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {data_w_SC[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {inst_w_SC[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {inst_w_SC[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {addr_w_SC[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {addr_w_SC[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports ren_OB]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports ren_OB]
set_input_delay -clock [get_clocks clk] -min -add_delay 1.000 [get_ports {data_r_SC[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 1.600 [get_ports {data_r_SC[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports {addr_r_SC[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports {addr_r_SC[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -1.500 [get_ports ready_signal]
set_output_delay -clock [get_clocks clk] -max -add_delay -1.100 [get_ports ready_signal]
